In [1]:
import pandas as pd

In [2]:
 d = {'name' : 'umer', 'date of birth' : '2002-07-16', 'rollnumber' : 48, 'marks' : 85}
 ds = pd.Series(d)

In [3]:
ds

name                   umer
date of birth    2002-07-16
rollnumber               48
marks                    85
dtype: object

In [4]:
 data = { 'name' : ['Umer', 'Hammad', 'Waleed','Anas'],
'run' : [35, 30, 2,56],
'Balls' : [32, 27, 3 ,58],
'minutes' : [32 , 24, 6,65],
'Dot' : [6, 3, 1,13]
}
 df = pd.DataFrame(data)
df

     name  run  Balls  minutes  Dot
0    Umer   35     32       32    6
1  Hammad   30     27       24    3
2  Waleed    2      3        6    1
3    Anas   56     58       65   13

In [5]:
sd= df[['name','run']]
sd

     name  run
0    Umer   35
1  Hammad   30
2  Waleed    2
3    Anas   56

In [6]:
sd.sort_values('run')

     name  run
2  Waleed    2
1  Hammad   30
0    Umer   35
3    Anas   56

In [7]:
da = df[['name','run', 'minutes']]

In [8]:
da

     name  run  minutes
0    Umer   35       32
1  Hammad   30       24
2  Waleed    2        6
3    Anas   56       65

In [9]:
sm_da = da
show= sm_da[(sm_da['run'] >= 30) & (sm_da['minutes'] >= 30)]

In [10]:
show

   name  run  minutes
0  Umer   35       32
3  Anas   56       65